Repository: NureVoropaievVladyslav/apzkr-pzpi-21-5-voropaiev-vladyslav
Catalog: apzkr-pzpi-21-5-voropaiev-vladyslav/Task1-Server/Resources/Resource.*.resx
Languages: uk_ua

# EmailNotValid
source: Email address is not valid.
uk_ua: Адреса електронної пошти не є дійсною.

# FullNameMustBeEightCharacters
source: Full name must be at least 8 characters long.
uk_ua: Повне ім'я повинно містити щонайменше 8 символів.

# UsernameMustBeFiveCharacters
source: Username must be at least 5 characters long.
uk_ua: Ім'я користувача повинно мати довжину не менше 5 символів.

# UsernameMustContainOnlyLowercase
source: Username can contain only lowercase characters.
uk_ua: Ім'я користувача може містити тільки малі літери.

# RequiredField
source: Field is required.
uk_ua: Поле обов'язкове.

# EmailUnavailable
source: Email address is already in use.
uk_ua: Адреса електронної пошти вже використовується.

# PasswordNoMatch
source: Password does not match.
uk_ua: Пароль не збігається.

# GreaterThanZero
source: Value must be greater than zero.
uk_ua: Значення повинно бути більше нуля.

# InvalidFishSpecie
source: Fish specie is invalid.
uk_ua: Вид риби є недійсним.

# PasswordBoundaries
source: Password must be between 8 and 32 characters.
uk_ua: Пароль повинен містити від 8 до 32 символів.

# PasswordCharacters
source: Password must contain at least one uppercase letter, one lowercase letter, one digit and one special symbol.
uk_ua: Пароль повинен містити принаймні одну велику літеру, одну малу літеру, одну цифру та один спеціальний символ.

source: Data not found.
uk_ua: Дані не знайдено.

# UserAlreadyExists
source: User with such credentials already exists.
uk_ua: Користувач з такими обліковими даними вже існує.
